[M_WandMakesTheMan MissionDefinition]
MissionDescription="Even with his sweet beard, Claptrap still doesn't feel like a proper sorcerer. He needs you to take his wand, jam it into some creatures, and then kill them in specific ways. In death, the creatures will charge the wand and Claptrap will be one step closer to becoming a real sorcerer."
TeaserText="A wizard is nothing without his wand! Bring a shock weapon and an explosive weapon."

[M_WandMakesTheMan:GiveWand MissionObjectiveDefinition]
ProgressMessage="Give wand to Claptrap"

[M_WandMakesTheMan:InsertWand1 MissionObjectiveDefinition]
ProgressMessage="Insert wand in golem"

[M_WandMakesTheMan:InsertWand2 MissionObjectiveDefinition]
ProgressMessage="Insert wand in spider"

[M_WandMakesTheMan:InsertWand3 MissionObjectiveDefinition]
ProgressMessage="Insert wand in orc"

[M_WandMakesTheMan:KillOrc MissionObjectiveDefinition]
ProgressMessage="Shoot orc in face"

[M_WandMakesTheMan:PickUpWand1 MissionObjectiveDefinition]
ProgressMessage="Pick up crappy wand"

[M_WandMakesTheMan:PickUpWand2 MissionObjectiveDefinition]
ProgressMessage="Pick up charged wand"

[M_WandMakesTheMan:PickUpWand3 MissionObjectiveDefinition]
ProgressMessage="Pick up super-charged wand"

[M_WandMakesTheMan:PickUpWand4 MissionObjectiveDefinition]
ProgressMessage="Pick up magic wand"
